# St7SetNLAStagedAnalysis

Sets the state of the staged analysis option for nonlinear static analysis.

long St7SetNLAStagedAnalysis(long uID, bool StagedAnalysis)
Input Parameters
uID
Strand7 model file ID.
StagedAnalysis
True to perform staged analysis.